# 3회 작업형1 (데이터 마님)
[데이터 마님 링크](https://www.datamanim.com/dataset/practice/ex3.html)

## 1번
결측치가 하나라도 존재하는 행의 경우 경우 해당 행을 삭제하라. 그후 남은 데이터의 상위(앞에서부터) 70%에 해당하는 데이터만 남겨둔 후 median_income 컬럼의 1분위수를 반올림하여 소숫점이하 2째자리까지 구하여라

In [1]:
import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e3_p1_1.csv')
df.head(5)

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity
0,-122.23,37.88,41.0,880.0,129.0,322.0,126.0,8.3252,452600.0,NEAR BAY
1,-122.22,37.86,21.0,7099.0,1106.0,2401.0,1138.0,8.3014,358500.0,NEAR BAY
2,-122.24,37.85,52.0,1467.0,190.0,496.0,177.0,7.2574,352100.0,NEAR BAY
3,-122.25,37.85,52.0,1274.0,235.0,558.0,219.0,5.6431,341300.0,NEAR BAY
4,-122.25,37.85,52.0,1627.0,280.0,565.0,259.0,3.8462,342200.0,NEAR BAY

### 결측치 제거 : `df.dropna()`

#### 1) 결측치가 있는 '행' 기준 제거 : df.dropna(axis=0)
- 그냥 dropna() 하면 axis=0가 디폴트

#### 2) 결측치가 있는 '열' 기준 제거 : df.dropna(axis=1)

#### 3) '특정 행 또는 열'을 대상으로 결측값 제거 : df["칼럼"].dropna()

### 인덱싱 iloc[ ] vs. loc[ ]

#### iloc : 위치 기반 인덱싱(정수 인덱싱)

- integer location의 약어로, 컴퓨터가 읽을 수 있는 indexing 값으로 데이터에 접근하는 것이다.
- 정수 인덱스를 사용하여 데이터를 선택하고 조작
    - 정수 인덱스는 0부터 시작
- **슬라이싱을 사용할 때, 마지막 인덱스는 포함되지 않음**

#### loc : 행/열 명칭 기반 인덱싱

- location의 약어로, 인간이 읽을 수 있는 label 값으로 데이터에 접근하는 것
- 인덱스 레이블(행 인덱스 또는 열 이름)을 사용하여 데이터를 선택하고 조작
- **슬라이싱을 사용할 때, 마지막 인덱스도 포함**
    - 예를 들어 df.loc[0:9, “칼럼명1”] 이라면 0번째~9번째 총 10개의 행이 선택되는 것

In [2]:
# print(df.shape) # (20640, 10)

# 결측치를 가진 행을 모두 제거 : df.dropna()
df = df.dropna().reset_index(drop=True)

# print(df.shape) # 결측치 제거 후 데이터

# 상위 70% 데이터만 남기기
df_70 = df[:int(len(df)*0.7)]
# df_filter = df.iloc[:int(len(df)*0.7)] # 위치기반 인덱싱 iloc 활용

result = round(df_70["median_income"].quantile(0.25), 2)
print(result)

2.51

## 2번
1990년도는 해당년도 평균 이하 GDP를 가지지만, 2010년도에는 해당년도 평균 이상 GDP를 가지는 국가의 숫자를 구하여라

In [39]:
import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e3_p1_2.csv')
df.head()

  Country Name Country Code  Year      Value
0   Arab World          ARB  1968  2576068.3
1   Arab World          ARB  1969  2843420.4
2   Arab World          ARB  1970  3138550.0
3   Arab World          ARB  1971  3642691.0
4   Arab World          ARB  1972  4331605.7

### set : 중복 허용X, 갯수 세는데 유용
중복된 값을 허용하지 않으므로, 동일한 값을 가진 항목은 한 번만 유지

In [40]:
df_1990 = df[df.Year == 1990]
df_2010 = df[df.Year == 2010]

# 1990년 데이터 중 평균 값 이하
df_1990_filter = df_1990[df_1990.Value <= df_1990.Value.mean()]

# 2010년 데이터 중 평균 값 이상
df_2010_filter = df_2010[df_2010.Value >= df_2010.Value.mean()]

# 두 조건을 모두 만족하는, 'Country Code' 열의 값이 공통으로 포함된 '교집합' 개수 반환
# 중복을 제거한 후, 유일한 값들로 이루어진 집합(set)을 생성
result = len(set(df_2010_filter['Country Code']) & set(df_1990_filter['Country Code']))
print(result)

5

df_2010_filter와 df_1990_filter에서 'Country Code' 열의 값을 가져와 교집합을 계산합니다. 즉, 두 데이터프레임에서 국가 코드가 겹치는 경우를 찾습니다. 그리고 그 개수를 result 변수에 저장합니다.

## 3번
데이터에서 결측치가 가장 많은 컬럼명을 출력하라

In [16]:
import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e3_p1_3.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3.0,"Braund, Mr. Owen Harris",male,22.0,1.0,0.0,A/5 21171,7.2500,NaN,S
1,2,1,1.0,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1.0,0.0,PC 17599,71.2833,C85,C
2,3,1,3.0,"Heikkinen, Miss. Laina",female,26.0,0.0,0.0,STON/O2. 3101282,7.9250,C85,S
3,4,1,1.0,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1.0,0.0,113803,53.1000,C123,S
4,5,0,3.0,"Allen, Mr. William Henry",male,35.0,0.0,0.0,373450,8.0500,C123,S

### `idxmax()` 활용 : 가장 큰 값의 인덱스 이름 추출

In [17]:
result = df.isnull().sum().idxmax()
print(result)

Fare

### df.isnull().sum()을 데이터프레임으로 생성 후 내림차순 정렬

In [42]:
# 칼럼별 결측치를 df로 저장
null_df = df.isnull().sum()

# 내림차순으로 정렬 후 첫번째 인덱스 추출
result = null_df.sort_values(ascending=False).index[0]
print(result)

Fare

---

# 3회 작업형1 (캐글)
- [캐글 1번](https://www.kaggle.com/code/agileteam/3rd-type1-1-3-1-1)
- [캐글 2번](https://www.kaggle.com/code/agileteam/3rd-type1-2-3-1-2)
- [캐글 3번](https://www.kaggle.com/code/agileteam/3rd-type1-3-3-1-3)

## 1번
2022년 데이터 중 2022년 중앙값보다 큰 값의 데이터 수

In [3]:
import pandas as pd
df = pd.read_csv("./Data/t1-data2.csv", index_col='year')
df.head()

,0,1,2,3,4,5,6,7,8,9,...,90,91,92,93,94,95,96,97,98,99
year,,,,,,,,,,,,,,,,,,,,,
2022년,69,37,57,70,40,75,8,67,89,91,...,79,56,98,21,14,25,17,10,60,17
2023년,52,13,22,70,92,80,8,56,17,96,...,62,47,59,6,25,96,69,87,28,64
2024년,88,44,32,55,64,8,4,2,62,44,...,98,95,40,59,69,71,86,53,93,64
2025년,80,97,15,4,74,12,100,60,47,47,...,30,11,2,54,9,52,51,81,78,22
2026년,64,66,62,56,67,80,90,24,58,78,...,93,15,88,67,7,82,5,61,15,63

### 1) 행, 열 전치를 생각
### 2) 조건은 항상 괄호로 감쌀 것

In [4]:
# 행, 열 전치
df = df.T

# 조건은 항상 괄호로 감싸라 !
cond = (df["2022년"] > df["2022년"].median())
result = len(df[cond])
print(result)

50

### 참고 - 다른 풀이 : 전치하지 않고, `sum()` 이용
- true, false의 개수를 세는 건 sum()
- '2022년' 행의 열 값이 median보다 큰 경우를 True로 평가
- 이 True 값들의 합을 계산 
- 결과적으로 '2022년' 행에서 median보다 큰 값의 개수를 반환

In [6]:
import pandas as pd
df = pd.read_csv("./Data/t1-data2.csv", index_col='year')

median = df.loc["2022년"].median()
result = sum(df.loc["2022년", :] > median)
print(result)

50

## 2번
결측치 데이터(행)을 제거하고, 앞에서부터 60% 데이터만 활용해, 'f1' 컬럼 3사분위 값을 구하시오
- 60%가 소수점일 경우 절사(예: 36.6 일때 36으로 계산)
- data: t1-data1.csv

In [8]:
import pandas as pd
df = pd.read_csv("./Data/t1-data1.csv")
df.head()

     id   age city    f1  f2    f4         f5
0  id01   2.0   서울   NaN   0  ENFJ  91.297791
1  id02   9.0   서울  70.0   1  ENFJ  60.339826
2  id03  27.0   서울  61.0   1  ISTJ  17.252986
3  id04  75.0   서울   NaN   2  INFP  52.667078
4  id05  24.0   서울  85.0   2  ISFJ  29.269869

In [9]:
# print(df.shape) # (90, 7)

df = df.dropna().reset_index(drop=True)
# print(df.shape) # (61, 7)

df = df.iloc[:int(len(df)*0.6)]
result = int(df["f1"].quantile(0.75)) # 소수점 절사
print(result)

77

## 3번
결측치가 제일 큰 값의 컬럼명을 구하시오.

In [10]:
import pandas as pd
df = pd.read_csv("./Data/t1-data1.csv")
df.head()

     id   age city    f1  f2    f4         f5
0  id01   2.0   서울   NaN   0  ENFJ  91.297791
1  id02   9.0   서울  70.0   1  ENFJ  60.339826
2  id03  27.0   서울  61.0   1  ISTJ  17.252986
3  id04  75.0   서울   NaN   2  INFP  52.667078
4  id05  24.0   서울  85.0   2  ISFJ  29.269869

In [15]:
# df.isnull().sum()

id       0
age      0
city     0
f1      29
f2       0
f4       0
f5       0
dtype: int64

### `idxmax()` 활용 : 가장 큰 값의 인덱스 이름 추출

In [12]:
result = df.isnull().sum().idxmax()
print(result)

f1

### df.isnull().sum()을 데이터프레임으로 생성 후 내림차순 정렬

In [14]:
# df.isnull().sum()의 값으로 데이터 프레임 생성, 칼럼명은 cnt_null
df_null = pd.DataFrame(df.isnull().sum(), columns = ["cnt_null"])

df_null = df_null['cnt_null'].sort_values(ascending=False)
result = df_null.index[0]
print(result)

f1